   +0x000 pNextAlloc       : Ptr64 _DPH_HEAP_BLOCK
   +0x000 AvailableEntry   : _LIST_ENTRY
   +0x000 TableLinks       : _RTL_BALANCED_LINKS
   +0x020 pUserAllocation  : Ptr64 UChar
   +0x028 pVirtualBlock    : Ptr64 UChar
   +0x030 nVirtualBlockSize : Uint8B
   +0x038 nVirtualAccessSize : Uint8B
   +0x040 nUserRequestedSize : Uint8B
   +0x048 nUserActualSize  : Uint8B
   +0x050 UserValue        : Ptr64 Void
   +0x058 UserFlags        : Uint4B
   +0x060 StackTrace       : Ptr64 _RTL_TRACE_BLOCK
   +0x068 AdjacencyEntry   : _LIST_ENTRY
   +0x078 pVirtualRegion   : Ptr64 UChar
