   +0x000 ListEntry        : _LIST_ENTRY
   +0x010 FunctionTable    : Ptr64 _IMAGE_RUNTIME_FUNCTION_ENTRY
   +0x018 TimeStamp        : _LARGE_INTEGER
   +0x020 MinimumAddress   : Uint8B
   +0x028 MaximumAddress   : Uint8B
   +0x030 BaseAddress      : Uint8B
   +0x038 Callback         : Ptr64     _IMAGE_RUNTIME_FUNCTION_ENTRY* 
   +0x040 Context          : Ptr64 Void
   +0x048 OutOfProcessCallbackDll : Ptr64 Wchar
   +0x050 Type             : _FUNCTION_TABLE_TYPE
   +0x054 EntryCount       : Uint4B
   +0x058 TreeNode         : _RTL_BALANCED_NODE
