   +0x000 SpinLockAcquireCount : Uint4B
   +0x004 SpinLockContentionCount : Uint4B
   +0x008 SpinLockSpinCount : Uint4B
   +0x00c IpiSendRequestBroadcastCount : Uint4B
   +0x010 IpiSendRequestRoutineCount : Uint4B
   +0x014 IpiSendSoftwareInterruptCount : Uint4B
   +0x018 ExInitializeResourceCount : Uint4B
   +0x01c ExReInitializeResourceCount : Uint4B
   +0x020 ExDeleteResourceCount : Uint4B
   +0x024 ExecutiveResourceAcquiresCount : Uint4B
   +0x028 ExecutiveResourceContentionsCount : Uint4B
   +0x02c ExecutiveResourceReleaseExclusiveCount : Uint4B
   +0x030 ExecutiveResourceReleaseSharedCount : Uint4B
   +0x034 ExecutiveResourceConvertsCount : Uint4B
   +0x038 ExAcqResExclusiveAttempts : Uint4B
   +0x03c ExAcqResExclusiveAcquiresExclusive : Uint4B
   +0x040 ExAcqResExclusiveAcquiresExclusiveRecursive : Uint4B
   +0x044 ExAcqResExclusiveWaits : Uint4B
   +0x048 ExAcqResExclusiveNotAcquires : Uint4B
   +0x04c ExAcqResSharedAttempts : Uint4B
   +0x050 ExAcqResSharedAcquiresExclusive : Uint4B
   +0x054 ExAcqResSharedAcquiresShared : Uint4B
   +0x058 ExAcqResSharedAcquiresSharedRecursive : Uint4B
   +0x05c ExAcqResSharedWaits : Uint4B
   +0x060 ExAcqResSharedNotAcquires : Uint4B
   +0x064 ExAcqResSharedStarveExclusiveAttempts : Uint4B
   +0x068 ExAcqResSharedStarveExclusiveAcquiresExclusive : Uint4B
   +0x06c ExAcqResSharedStarveExclusiveAcquiresShared : Uint4B
   +0x070 ExAcqResSharedStarveExclusiveAcquiresSharedRecursive : Uint4B
   +0x074 ExAcqResSharedStarveExclusiveWaits : Uint4B
   +0x078 ExAcqResSharedStarveExclusiveNotAcquires : Uint4B
   +0x07c ExAcqResSharedWaitForExclusiveAttempts : Uint4B
   +0x080 ExAcqResSharedWaitForExclusiveAcquiresExclusive : Uint4B
   +0x084 ExAcqResSharedWaitForExclusiveAcquiresShared : Uint4B
   +0x088 ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive : Uint4B
   +0x08c ExAcqResSharedWaitForExclusiveWaits : Uint4B
   +0x090 ExAcqResSharedWaitForExclusiveNotAcquires : Uint4B
   +0x094 ExSetResOwnerPointerExclusive : Uint4B
   +0x098 ExSetResOwnerPointerSharedNew : Uint4B
   +0x09c ExSetResOwnerPointerSharedOld : Uint4B
   +0x0a0 ExTryToAcqExclusiveAttempts : Uint4B
   +0x0a4 ExTryToAcqExclusiveAcquires : Uint4B
   +0x0a8 ExBoostExclusiveOwner : Uint4B
   +0x0ac ExBoostSharedOwners : Uint4B
   +0x0b0 ExEtwSynchTrackingNotificationsCount : Uint4B
   +0x0b4 ExEtwSynchTrackingNotificationsAccountedCount : Uint4B
