   +0x000 Policy           : _KSCHEDULING_GROUP_POLICY
   +0x008 RelativeWeight   : Uint4B
   +0x00c ChildMinRate     : Uint4B
   +0x010 ChildMinWeight   : Uint4B
   +0x014 ChildTotalWeight : Uint4B
   +0x018 QueryHistoryTimeStamp : Uint8B
   +0x020 NotificationCycles : Int8B
   +0x028 MaxQuotaLimitCycles : Int8B
   +0x030 MaxQuotaCyclesRemaining : Int8B
   +0x038 SchedulingGroupList : _LIST_ENTRY
   +0x038 Sibling          : _LIST_ENTRY
   +0x048 NotificationDpc  : Ptr64 _KDPC
   +0x050 ChildList        : _LIST_ENTRY
   +0x060 Parent           : Ptr64 _KSCHEDULING_GROUP
   +0x080 PerProcessor     : [1] _KSCB
