   +0x000 Level            : Uint4B
   +0x004 RaiseIrqls       : Uint4B
   +0x008 AcquireSpinLocks : Uint4B
   +0x00c SynchronizeExecutions : Uint4B
   +0x010 AllocationsAttempted : Uint4B
   +0x014 AllocationsSucceeded : Uint4B
   +0x018 AllocationsSucceededSpecialPool : Uint4B
   +0x01c AllocationsWithNoTag : Uint4B
   +0x020 TrimRequests     : Uint4B
   +0x024 Trims            : Uint4B
   +0x028 AllocationsFailed : Uint4B
   +0x02c AllocationsFailedDeliberately : Uint4B
   +0x030 Loads            : Uint4B
   +0x034 Unloads          : Uint4B
   +0x038 UnTrackedPool    : Uint4B
   +0x03c UserTrims        : Uint4B
   +0x040 CurrentPagedPoolAllocations : Uint4B
   +0x044 CurrentNonPagedPoolAllocations : Uint4B
   +0x048 PeakPagedPoolAllocations : Uint4B
   +0x04c PeakNonPagedPoolAllocations : Uint4B
   +0x050 PagedBytes       : Uint8B
   +0x058 NonPagedBytes    : Uint8B
   +0x060 PeakPagedBytes   : Uint8B
   +0x068 PeakNonPagedBytes : Uint8B
   +0x070 BurstAllocationsFailedDeliberately : Uint4B
   +0x074 SessionTrims     : Uint4B
   +0x078 OptionChanges    : Uint4B
   +0x07c VerifyMode       : Uint4B
   +0x080 PreviousBucketName : _UNICODE_STRING
   +0x090 ExecutePoolTypes : Uint4B
   +0x094 ExecutePageProtections : Uint4B
   +0x098 ExecutePageMappings : Uint4B
   +0x09c ExecuteWriteSections : Uint4B
   +0x0a0 SectionAlignmentFailures : Uint4B
   +0x0a4 UnsupportedRelocs : Uint4B
   +0x0a8 IATInExecutableSection : Uint4B
