   +0x000 TotalMemoryReserved : Uint8B
   +0x008 TotalMemoryCommitted : Uint8B
   +0x010 TotalMemoryLargeUCR : Uint8B
   +0x018 TotalSizeInVirtualBlocks : Uint8B
   +0x020 TotalSegments    : Uint4B
   +0x024 TotalUCRs        : Uint4B
   +0x028 CommittOps       : Uint4B
   +0x02c DeCommitOps      : Uint4B
   +0x030 LockAcquires     : Uint4B
   +0x034 LockCollisions   : Uint4B
   +0x038 CommitRate       : Uint4B
   +0x03c DecommittRate    : Uint4B
   +0x040 CommitFailures   : Uint4B
   +0x044 InBlockCommitFailures : Uint4B
   +0x048 PollIntervalCounter : Uint4B
   +0x04c DecommitsSinceLastCheck : Uint4B
   +0x050 HeapPollInterval : Uint4B
   +0x054 AllocAndFreeOps  : Uint4B
   +0x058 AllocationIndicesActive : Uint4B
   +0x05c InBlockDeccommits : Uint4B
   +0x060 InBlockDeccomitSize : Uint8B
   +0x068 HighWatermarkSize : Uint8B
   +0x070 LastPolledSize   : Uint8B
