   +0x000 P1Home           : Uint8B
   +0x008 P2Home           : Uint8B
   +0x010 P3Home           : Uint8B
   +0x018 P4Home           : Uint8B
   +0x020 P5               : Uint8B
   +0x028 Spare1           : Uint8B
   +0x030 Xmm6             : _M128A
   +0x040 Xmm7             : _M128A
   +0x050 Xmm8             : _M128A
   +0x060 Xmm9             : _M128A
   +0x070 Xmm10            : _M128A
   +0x080 Xmm11            : _M128A
   +0x090 Xmm12            : _M128A
   +0x0a0 Xmm13            : _M128A
   +0x0b0 Xmm14            : _M128A
   +0x0c0 Xmm15            : _M128A
   +0x0d0 TrapFrame        : Uint8B
   +0x0d8 OutputBuffer     : Uint8B
   +0x0e0 OutputLength     : Uint8B
   +0x0e8 Spare2           : Uint8B
   +0x0f0 MxCsr            : Uint8B
   +0x0f8 Rbp              : Uint8B
   +0x100 Rbx              : Uint8B
   +0x108 Rdi              : Uint8B
   +0x110 Rsi              : Uint8B
   +0x118 R12              : Uint8B
   +0x120 R13              : Uint8B
   +0x128 R14              : Uint8B
   +0x130 R15              : Uint8B
   +0x138 Return           : Uint8B
