   +0x000 TotalMemoryReserved : Uint4B
   +0x004 TotalMemoryCommitted : Uint4B
   +0x008 TotalMemoryLargeUCR : Uint4B
   +0x00c TotalSizeInVirtualBlocks : Uint4B
   +0x010 TotalSegments    : Uint4B
   +0x014 TotalUCRs        : Uint4B
   +0x018 CommittOps       : Uint4B
   +0x01c DeCommitOps      : Uint4B
   +0x020 LockAcquires     : Uint4B
   +0x024 LockCollisions   : Uint4B
   +0x028 CommitRate       : Uint4B
   +0x02c DecommittRate    : Uint4B
   +0x030 CommitFailures   : Uint4B
   +0x034 InBlockCommitFailures : Uint4B
   +0x038 CompactHeapCalls : Uint4B
   +0x03c CompactedUCRs    : Uint4B
   +0x040 AllocAndFreeOps  : Uint4B
   +0x044 InBlockDeccommits : Uint4B
   +0x048 InBlockDeccomitSize : Uint4B
   +0x04c HighWatermarkSize : Uint4B
   +0x050 LastPolledSize   : Uint4B
