   +0x000 Level            : Uint4B
   +0x004 RaiseIrqls       : Uint4B
   +0x008 AcquireSpinLocks : Uint4B
   +0x00c SynchronizeExecutions : Uint4B
   +0x010 AllocationsAttempted : Uint4B
   +0x014 AllocationsSucceeded : Uint4B
   +0x018 AllocationsSucceededSpecialPool : Uint4B
   +0x01c AllocationsWithNoTag : Uint4B
   +0x020 TrimRequests     : Uint4B
   +0x024 Trims            : Uint4B
   +0x028 AllocationsFailed : Uint4B
   +0x02c AllocationsFailedDeliberately : Uint4B
   +0x030 Loads            : Uint4B
   +0x034 Unloads          : Uint4B
   +0x038 UnTrackedPool    : Uint4B
   +0x03c UserTrims        : Uint4B
   +0x040 CurrentPagedPoolAllocations : Uint4B
   +0x044 CurrentNonPagedPoolAllocations : Uint4B
   +0x048 PeakPagedPoolAllocations : Uint4B
   +0x04c PeakNonPagedPoolAllocations : Uint4B
   +0x050 PagedBytes       : Uint4B
   +0x054 NonPagedBytes    : Uint4B
   +0x058 PeakPagedBytes   : Uint4B
   +0x05c PeakNonPagedBytes : Uint4B
   +0x060 BurstAllocationsFailedDeliberately : Uint4B
   +0x064 SessionTrims     : Uint4B
   +0x068 OptionChanges    : Uint4B
   +0x06c VerifyMode       : Uint4B
   +0x070 PreviousBucketName : _UNICODE_STRING
   +0x078 ActivityCounter  : Uint4B
   +0x07c PreviousActivityCounter : Uint4B
   +0x080 WorkerTrimRequests : Uint4B
